In [2]:
import pandas as pd

# データフレームの作成
data = {"Name":["Alice","Bob","Charlie","David","Eve"],
        "Age":[25,30,35,40,45],}

df = pd.DataFrame(data)
df

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35
3    David   40
4      Eve   45

In [3]:
df2 = pd.DataFrame({"Name":["Alice","Bob"],"Salary":[50000,60000]})
df2

    Name  Salary
0  Alice   50000
1    Bob   60000

In [ ]:
# Name をキーにして結合
# how で結合の方法を指定(left,right,inner,outer)
df3 = pd.merge(df,df2,on="Name",how="left")
df3

      Name  Age   Salary
0    Alice   25  50000.0
1      Bob   30  60000.0
2  Charlie   35      NaN
3    David   40      NaN
4      Eve   45      NaN